[
    {
        "ModuleCode": "ACC1002",
        "ModuleTitle": "Financial Accounting",
        "Department": "ACCOUNTING",
        "ModuleDescription": "The course provides an introduction to financial accounting. It examines accounting from an external user's perspective: an external user being an investor or a creditor. Such users would need to understand financial accounting in order to make investing or lending decisions. However, to attain a good understanding, it is also necessary to be familiar with how the information is derived. Therefore, students would learn how to prepare the reports or statements resulting from financial accounting and how to use them for decision-making.",
        "ModuleCredit": "4",
        "Workload": "2-2-0-3-4",
        "Preclusion": "Students who have passed FNA1002 are not allowed to take ACC1002.",
        "ExamDate": "2015-11-25T13:00+0800",
        "Types": [
            "Module"
        ],
        "Timetable": [
            {
                "ClassNo": "V1",
                "LessonType": "LECTURE",
                "WeekText": "EVERY WEEK",
                "DayText": "WEDNESDAY",
                "StartTime": "1000",
                "EndTime": "1200",
                "Venue": "LT16"
            }
        ]
    },
    {
        "ModuleCode": "ACC1002X",
        "ModuleTitle": "Financial Accounting",
        "Department": "ACCOUNTING",
        "ModuleDescription": "The course provides an introduction to financial accounting. It examines accounting from an external user's perspective: an external user being an investor or a creditor. Such users would need to understand financial accounting in order to make investing or lending decisions. However, to attain a good understanding, it is also necessary to be familiar with how the information are derived. Therefore, students would learn how to prepare the reports or statements resulting from financial accounting and how to use them for decision-making.",
        "ModuleCredit": "4",
        "Preclusion": "Students who have passed CS1304 or EC3212 or BK1003 or BZ1002 or BH1002 or BZ1002E or BH1002E or FNA1002E or FNA1002X are not allowed to take ACC1002X.",
        "ExamDate": "2015-11-25T13:00+0800",
        "Types": [
            "Module",
            "UEM"
        ],
        "Timetable": [
            {
                "ClassNo": "V1",
                "LessonType": "LECTURE",
                "WeekText": "EVERY WEEK",
                "DayText": "WEDNESDAY",
                "StartTime": "1000",
                "EndTime": "1200",
                "Venue": "LT16"
            }
        ]
    }
]